app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-05-19 22:34:10.586069"], ["id", 1]]
---
def update
  binding.pry
  @school_class = SchoolClass.find(params[:id])
  @school_class.update(params.require(:school_class).permit(:title, :room_number))